#!/usr/bin/env python3
## coding: UTF-8

import rospy
from std_msgs.msg import String


rospy.init_node('chr')
pub = rospy.Publisher('chrter', String, queue_size=10)
rate = rospy.Rate(1)

while not rospy.is_shutdown():
	chrr = String()
	issyu = input()
	print('句を送信')
	if issyu == '1':
		chrr = '秋の田のかりほの庵の苔をあらみわが衣手は露に濡れつつ'
	if issyu == '2':
		chrr = '春すぎて夏来にけらし白たへのころもほすてふあまの香具山'
	if issyu == '3':
		chrr = 'あしひきの山鳥の尾のしだり尾のながながし夜をひとりかも寝む'
	if issyu == '4':
		chrr = '田子の浦にうちいでて見れば白たへの富士の高嶺に雪は降りつつ'
	if issyu == '5':
		 chrr = '奥山にもみぢ踏み分け鳴く鹿の声聞く時ぞ秋は悲しき'
	if issyu == '6':
		 chrr = 'かささぎの渡せる橋に置く霜の白きを見れば夜ぞふけにける'
	if issyu == '7':
	 	 chrr = 'あまの原ふりさけ見ればかすがなるみ笠の山にいでし月かも'
	if issyu == '8':
		 chrr = 'わが庵は都のたつみしかぞ住む世を宇治山と人は言ふなり'
	if issyu == '9':
		 chrr = '花の色はうつりにけりないたづらにわが身世にふるながめせしまに'
	if issyu == '10':
		 chrr = 'これやこの行くも帰るも別れては知るも知らぬも逢坂の関'
	if issyu == '11':
		 chrr = 'わたの原八十島かけて漕ぎいでぬと人には告げよあまの釣舟'
	if issyu == '12':
		 chrr = 'あまつ風雲のかよひ路吹きとぢよをとめの姿しばしとどめむ'
	if issyu == '13':
		 chrr = 'つくばねの峰より落つるみなの川恋ぞ積りて淵となりぬる'
	if issyu == '14':
		 chrr = 'みちのくの忍ぶもぢずり誰ゆゑに乱れそめにしわれならなくに'
	if issyu == '15':
		chrr = '君がため春の野にいでて若菜摘むわがころも手に雪は降りつつ'
	if issyu == '16':
		chrr = '立ち別れいなばの山の峰に生ふるまつとし聞かばいざ帰り来む'
	if issyu == '17':
		chrr = 'ちはやふる神代も聞かず竜田川からくれなゐに水くくるとは'
	if issyu == '18':
		chrr = 'すみの江の岸による波よるさへや夢のかよひ路人目よくらむ'
	if issyu == '19':
		chrr = 'なにはがた短きあしのふしのまもあはでこの世をすごしてよとや'	
	if issyu == '20':
		chrr = 'わびぬれば今はた同じなにはなるみをつくしてもあはむとぞ思ふ'
	if issyu == '21':
		chrr = '今来むと言ひしばかりに長月の有明の月を待ちいでつるかな'
	if issyu == '22':
		chrr = '吹くからに秋の草木のしをるればむべ山風を嵐と言ふらむ'
	if issyu == '23':
		chrr = '月見ればちぢにものこそ悲しけれわが身ひとつの秋にはあらねど'
	if issyu == '24':
		chrr = 'このたびはぬさも取りあへずたむけ山もみぢのにしき神のまにまに'
	if issyu == '25':
		chrr = '名にし負はば逢坂山のさねかづら人に知られで来るよしもがな'
	if issyu == '26':
		chrr = '小倉山峰のもみぢ葉心あらば今ひとたびのみゆき待たなむ'
	if issyu == '27':
		chrr = 'みかの原わきて流るる泉川いつ見きとてか恋しかるらむ'
	if issyu == '28':
		chrr = '山里は冬ぞ寂しさまさりける人目も草もかれぬと思へば'
	if issyu == '29':
		chrr = '心あてに折らばや折らむ初霜の置きまどはせる白菊の花'
	if issyu == '30':
		chrr = '有明のつれなく見えし別れより暁ばかりうきものはなし'
	if issyu == '31':
		chrr = '朝ぼらけ有明の月と見るまでに吉野の里に降れる白雪'
	if issyu == '32':
		chrr = '山川に風のかけたるしがらみは流れもあへぬもみぢなりけり'
	if issyu == '33':
		chrr = 'ひさかたの光のどけき春の日にしづ心なく花の散るらむ'
	if issyu == '34':
		chrr = 'たれをかも知る人にせむ高砂の松も昔の友ならなくに'
	if issyu == '35':
		chrr = '人はいさ心も知らずふる里は花ぞ昔の香に匂(にほ)ひける'
	if issyu == '36':
		chrr = '夏の夜はまだ宵ながら明けぬるを雲のいづこに月宿るらむ'
	if issyu == '37':
		chrr = '白露に風の吹きしく秋の野はつらぬきとめぬ玉ぞ散りける'
	if issyu == '38':
		chrr = '忘らるる身をば思はずちかひてし人の命の惜しくもあるかな'
	if issyu == '39':
		chrr = '浅茅生の小野のしの原忍ぶれどあまりてなどか人の恋しき'
	if issyu == '40':
		chrr = '忍ぶれど色にいでにけりわが恋はものや恩ふと人の問ふまで'
	if issyu == '41':
		chrr = '恋すてふわが名はまだき立ちにけり人知れずこそ思ひそめしか'
	if issyu == '42':
		chrr = 'ちぎりきなかたみに袖をしぼりつつ末の松山波越さじとは'
	if issyu == '43':
		chrr = 'あひ見ての後の心にくらぶれば昔はものを思はざりけり'
	if issyu == '44':
		chrr = 'あふことの絶えてしなくばなかなかに人をも身をも恨みざらまし'
	if issyu == '45':
		chrr = 'あはれとも言ふべき人は思ほえで身のいたづらになりぬべきかな'
	if issyu == '46':
		chrr = 'ゆらのとを渡る舟人かぢを絶え行くへも知らぬ恋の道かな'
	if issyu == '47':
		chrr = '八重むぐら茂れるやどの寂しきに人こそ見えね秋は来にけり'
	if issyu == '48':
		chrr = '風をいたみ岩打つ波のおのれのみくだけてものを思ふ頃かな'
	if issyu == '49':
		chrr = 'み垣もり衛士のたく火の夜はもえ昼は消えつつものをこそ思へ'
	if issyu == '50':
		chrr = '君がため惜しからざりし命さへ長くもがなと思ひけるかな'
	if issyu == '51':
		chrr = 'かくとだにえやはいぶきのさしも草さしも知らじなもゆる思ひを'
	if issyu == '52':
		chrr = '明けぬれば暮るるものとは知りながらなほ恨めしき朝ぼらけかな'
	if issyu == '53':
		chrr = '歎きつつひとりぬる夜の明くるまはいかに久しきものとかは知る'
	if issyu == '54':
		chrr = '忘れじの行く末まではかたければ今日を限りの命ともがな'
	if issyu == '55':
		chrr = '滝の音は絶えて久しくなりぬれど名こそ流れてなほ聞こえけれ'
	if issyu == '56':
		chrr = 'あらざらむこの世のほかの思ひ出に今ひとたぴのあふこともがな'
	if issyu == '57':
		chrr = 'めぐりあひて見しやそれともわかぬまに雲隠れにし夜はの月かな'
	if issyu == '58':
		chrr = 'ありま山ゐなの笹原風吹けばいでそよ人を忘れやはする'
	if issyu == '59':
		chrr = 'やすらはで寝なましものをさ夜ふけてかたぶくまでの月を見しかな'
	if issyu == '60':
		chrr = '大江山いく野の道の遠ければまだふみも見ずあまの橋立'
	if issyu == '61':
		chrr = 'いにしへの奈良の都の八重桜今日九重ににほひぬるかな'
	if issyu == '62':
		chrr = '夜をこめてとりのそらねははかるともよに逢坂の関は許さじ'
	if issyu == '63':
		chrr = '今はただ思ひ絶えなむとばかりを人づてならで言ふよしもがな'
	if issyu == '64':
		chrr = '朝ぼらけ宇治の川霧絶え絶えにあらはれわたる瀬々の網代木'
	if issyu == '65':
		chrr = '恨みわびほさぬ袖だにあるものを恋にくちなむ名こそ惜しけれ'
	if issyu == '66':
		chrr = 'もろともにあはれと思へ山桜花よりほかに知る人もなし'
	if issyu == '67':
		chrr = '春の夜の夢ばかりなる手枕にかひなく立たむ名こそ惜しけれ'
	if issyu == '68':
		chrr = '心にもあらでうき世にながらへば恋しかるべき夜はの月かな'
	if issyu == '69':
		chrr = '嵐吹くみむろの山のもみぢ葉は竜田の川のにしきなりけり'
	if issyu == '70':
		chrr = '寂しさにやどを立ちいでてながむればいづくも同じ秋の夕暮'
	if issyu == '71':
		chrr = '夕されば門田の稲葉おとづれてあしのまろ屋に秋風ぞ吹く'
	if issyu == '72':
		chrr = '音に聞くたかしの浜のあだ波はかけじや袖の濡れもこそすれ'
	if issyu == '73':
		chrr = '高砂のをのへの桜咲きにけりと山のかすみ立たずもあらなむ'
	if issyu == '74':
		chrr = 'うかりける人を初瀬の山おろし激しかれとは祈らぬものを'
	if issyu == '75':
		chrr = 'ちぎりおきしさせもが露を命にてあはれ今年の秋もいぬめり'
	if issyu == '76':
		chrr = 'わたの原漕ぎいでて見ればひさかたの雲居にまがふ沖つ白波'
	if issyu == '77':
		chrr = '瀬を旱み岩にせかるる滝川のわれても末にあはむとぞ思ふ'
	if issyu == '78':
		chrr = '淡路島かよふ千鳥の鳴く声にいく夜寝覚めぬ須磨の関もり'
	if issyu == '79':
		chrr = '秋風にたなびく雲の絶え間よりもれいづる月の影のさやけさ'
	if issyu == '80':
		chrr = '長からむ心も知らず黒髪の乱れて今朝(けさ)はものをこそ思へ'
	if issyu == '81':
		chrr = 'ほととぎす鳴きつるかたをながむればただ有明の月ぞ残れる'
	if issyu == '82':
		chrr = '思ひわびさても命はあるものをうきにたへぬは涙なりけり'
	if issyu == '83':
		chrr = '世の中よ道こそなけれ思ひ入る山の奥にも鹿ぞ鳴くなる'	
	if issyu == '84':
		chrr = '長らへばまたこの頃やしのばれむうしと見し世ぞ今は恋しき'
	if issyu == '85':
		chrr = '夜もすがらもの思ふ頃は明けやらでねやのひまさへつれなかりけり'
	if issyu == '86':
		chrr = '歎けとて月やはものを思はするかこち顔なるわか涙かな'
	if issyu == '87':
		chrr = 'むらさめの露もまだひぬまきの葉に霧たちのぼる秋の夕暮'
	if issyu == '88':
		chrr = 'なには江のあしのかり寝のひとよゆゑ身をつくしてや恋ひわたるべき'
	if issyu == '89':
		chrr = '玉の緒よ絶えなば絶えね長らへば忍ぶることの弱りもぞする'
	if issyu == '90':
		chrr = '見せばやな雄島のあまの袖だにも濡れにぞ濡れし色は変らず'
	if issyu == '91':
		chrr = 'きりぎりす鳴くや霜夜のさむしろにころもかた敷きひとりかも寝む'
	if issyu == '92':
		chrr = 'わが袖は潮ひに見えぬ沖の石の人こそ知らね乾(かわ)くまもなし'
	if issyu == '93':
		chrr = '世の中は常にもがもななぎさ漕ぐあまのを舟の綱手かなしも'
	if issyu == '94':
		chrr = 'み吉野の山の秋風さ夜ふけてふるさと寒くころも打つなり'
	if issyu == '95':
		chrr = 'おほけなくうき世の民におほふかなわが立つそまに墨染の袖'
	if issyu == '96':
		chrr = '花さそふ嵐の庭の雪ならでふりゆくものはわが身なりけり'
	if issyu == '97':
		chrr = '来ぬ人をまつほの浦の夕なぎにやくやもしほの身もこがれつつ'
	if issyu == '98':
		chrr = '風そよぐならの小川の夕暮はみそぎぞ夏のしるしなりける'
	if issyu == '99':
		chrr = '人も惜し人も恨めしあぢきなく世を思ふゆゑにもの思ふ身は'
	if issyu == '100':
		chrr = 'ももしきや古き軒ばの忍ぶにもなほあまりある昔なりけり'

	#happy_chr = String()
	#happy_chr.data = "Hppy New Year !" 
	pub.publish(chrr)
	rate.sleep()
